# команда input() считывает единственный аргумент – строку
numbers = input()
# команда split() разделяет строку на две по пробелу
numbers = numbers.split(" ")
a, b = numbers[0], numbers[1]
# команда int() переводит строки в числа
a = int(a)
b = int(b)
# выводим результат
print(a + b)

# написать программу, которая получает на вход матрицу A размера 5*5 и столбец B размера 5*1 и вычисляет корень матричного уравнения A*X = B
# Входные данные:
# 1 0 0 0 0
# 0 1 0 0 0
# 0 0 1 0 0
# 0 0 0 1 0
# 0 0 0 0 1
# 1
# 1
# 1
# 1
# 1
# Выходные данные:
# 1
# 1
# 1
# 1
# 1
import math
# команда input() считывает единственный аргумент – строку
numbers = input()
# команда split() разделяет строку на две по пробелу
numbers = numbers.split(" ")
a, b = numbers[0], numbers[1]
# команда int() переводит строки в числа
a = int(a)
b = int(b)
# выводим результат
print(a + b)

# написать программу, которая получает на вход матрицу A размера 5*5 и столбец B размера 5*1 и вычисляет корень матричного уравнения A*X = B
# Входные данные:
# 1 0 0 0 0
# 0 1 0 0 0
# 0 0 1 0 0
# 0 0 0 1 0
# 0 0 0 0 1
# 1
# 1
# 1
# 1
# 1
# Выходные данные:
# 1
# 1
# 1
# 1
# 1
import math
# команда input() считывает единственный аргумент – строку
numbers = input()
# команда split() разделяет строку на две по пробелу
numbers = numbers.split(" ")
a, b = numbers[0], numbers[1]
# команда int() переводит строки в числа
a = int(a)
b = int(b)
# выводим результат
print(a + b)

# написать программу, которая получ